import numpy as np
import pandas as pd
import tensorflow as tf


df = pd.DataFrame({'item1' : [1, 2, 3, 4, 5],
                    'item2' : [10, 20, 30, 40, 50],
                    'label' : ['a', 'b', 'c', 'd', 'e'] })

print(df)

items = df[['item1','item2']]
labels = df['label']


print(items)
print(labels)

# dataset을 만드는 함수. feature, label 매칭
ts_dataset = tf.data.Dataset.from_tensor_slices((items, labels))
print(ts_dataset) # 출력해봤자 그냥 타입이다.


# take는 원하는 개수만큼 텐서를 가져온다.
for x, y in ts_dataset.take(5):
    print("#" * 50)
    print(" feature: ", x)
    print(" label: ", y)


# batch는 배치로 분리한다. 학습값과 테스트값을 분리할 때
ts_dataset = tf.data.Dataset.from_tensor_slices((items, labels))


## 3개씩 tensor를 묶어서 미니배치를 생성.
ts_dataset = ts_dataset.batch(3)

for x, y in ts_dataset.take(5): # 그룹이 2개밖에 없기 때문에 2개만 가져온다.
    print("#"*50)
    print(" feature : ", x)
    print("  labels : ", y)


# repeat()은 데이터셋을 반복하여 학습의 epoch만큼 수를 제공한다.
# 이렇게 하면 한번의 epoch동안 모든 데이터를 사용할 수 있으며,
# 반복하여 데이터를 공급할 수 있다.

ts_dataset = tf.data.Dataset.from_tensor_slices((items,labels))
## 3개씩 tensor를 묶어서 미니배치를 생성.
ts_dataset = ts_dataset.batch(3).repeat()

for x, y in ts_dataset.take(5):
    print("#"*50)
    print(" feature : ", x)
    print("  labels : ", y)


# shuffle 무작위로 순서를 섞는다.
ts_dataset = tf.data.Dataset.from_tensor_slices((items, labels))
ts_dataset = ts_dataset.shuffle(10)  # 섞을 때 임시 버퍼이다. 데이터셋보다 크게 준다.

for x, y in ts_dataset.take(5):
    print("#"*50)
    print(" feature : ", x)
    print("  labels : ", y)


ts_dataset = tf.data.Dataset.from_tensor_slices((items,labels))
## 일단 무작위로 행단위로 순서를 바꾸고 3개씩 tensor를 묶어서 미니배치를 생성.
ts_dataset = ts_dataset.shuffle(10).batch(3)

for x, y in ts_dataset.take(5):
    print("#"*50)
    print(" feature : ", x)
    print("  labels : ", y)



######################################################################################################## todo 주의 요망
aaa = [[1,2,3,4,5],[6,7,8,9,10]]
# print(questions[:, :-1])   # 이건 배열이 아니기 때문에 이렇게 하면 안된다. 아래와 같이 배열로 변형한뒤에 해야 한다.
aaa = np.array(aaa)
print(aaa[:,1:])

questions = [[8178, 7915, 4207, 3060, 41, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 7971, 47, 919, 7954, 998, 1716, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 7973, 1435, 4653, 7954, 3652, 67, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 7973, 1435, 4653, 7954, 1295, 3652, 67, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 8002, 8002, 7998, 7954, 4190, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 8005, 7990, 2192, 919, 78, 821, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 8005, 7990, 2192, 199, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 2161, 645, 1129, 7954, 66, 5116, 852, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 2161, 782, 7612, 172, 8, 2570, 436, 48, 203, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 2161, 782, 7612, 204, 84, 183, 352, 1258, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]
answers = [[8178, 3844, 74, 7894, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 1830, 5502, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 3400, 777, 131, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 3400, 777, 131, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 985, 2300, 1492, 2184, 5470, 50, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 69, 2064, 456, 5, 137, 2188, 17, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 69, 2064, 456, 5, 137, 2188, 17, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 13, 1892, 30, 71, 25, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 350, 3985, 16, 32, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0], [8178, 350, 3985, 16, 32, 1, 8179, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]

questions = np.array(questions)
answers = np.array(answers)

ts_dataset = tf.data.Dataset.from_tensor_slices((
    {
        'inputs': questions,
        'dec_inputs': answers[:, :-1] # 디코더의 입력. 마지막 패딩 토큰이 제거된다.
    },
    {
        'outputs': answers[:, 1:]  # 맨 처음 토큰이 제거된다. 다시 말해 시작 토큰이 제거된다.
    },
))
for x, y in ts_dataset.take(1):
    print("#"*50)
    print(" feature : ", x)
    print()
    print("  labels : ", y)